#### AnalyticalSystemDomain Enumeration

---

|  |
| --- |
| See Also |

The domain type of analytical system.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum AnalyticalSystemDomain ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalyticalSystemDomain ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalyticalSystemDomain ``` |

# Members

| Member name | Description |
| --- | --- |
| WaterLoop |  |
| AirSystem |  |
| ElectricalSystem |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace